Demo of PySpark in VSCode

In [1]:
from pyspark.sql import SparkSession

Start Spark

In [ ]:
spark = SparkSession.builder.master('local[*]').getOrCreate()

print(f'Spark version: {spark.version}')
print(f'Spark UI available at: http://localhost:4040')

WARNING: Using incubator modules: jdk.incubator.vector
Using Spark's default log4j profile: org/apache/spark/log4j2-defaults.properties
Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
25/12/29 16:49:49 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

Spark version: 4.1.0
Spark UI available at: http://localhost:4040

Create some sample data

In [6]:
df = spark.createDataFrame([
    ('Alice', 34, 'Data Engineer'),
    ('Bob', 45, 'Data Scientist'),
    ('Charlie', 29, 'ML Engineer'),
    ('Diana', 38, 'Software Engineer')
], ['name', 'age', 'role'])
df.show()

+-------+---+-----------------+
|   name|age|             role|
+-------+---+-----------------+
|  Alice| 34|    Data Engineer|
|    Bob| 45|   Data Scientist|
|Charlie| 29|      ML Engineer|
|  Diana| 38|Software Engineer|
+-------+---+-----------------+

Select some rows and display the result using Pandas

In [8]:
df.where("role LIKE '%Engineer%'").toPandas()

      name  age               role
0    Alice   34      Data Engineer
1  Charlie   29        ML Engineer
2    Diana   38  Software Engineer